{
  "version": "1.0",
  "exportDate": "2025-12-12T02:07:06.461Z",
  "sequences": {
    "11": [
      "Strategy and audits",
      "Audit the main website for major technical SEO issues and rank them by impact on organic traffic.",
      "Create a 6-month SEO strategy for a niche service website targeting leads in a specific country.",
      "Suggest a launch SEO plan for a brand-new domain in a competitive niche with zero authority.",
      "Outline a simple SEO framework for a solo freelancer managing several client sites per month.",
      "Review a list of key pages and map them to funnel stages with suggested SEO actions.",
      "Design an SEO strategy for a local service business site to dominate Google Maps and organic results.",
      "Turn high-level business goals into concrete SEO KPIs with realistic timelines.",
      "Recommend how to split focus between SEO for leads vs. SEO for brand awareness for a B2B SaaS site.",
      "Create a monthly SEO maintenance checklist for a 200-page content website.",
      "Propose an improved site structure to strengthen topical authority and internal linking on the domain.",
      "Keyword research and topic ideation",
      "Generate 50 long-tail keywords about a chosen topic targeting buyers in one country.",
      "Classify a keyword list by search intent and funnel stage for better content planning.",
      "Cluster a keyword list into topic groups and suggest one pillar page plus supporting articles per group.",
      "For a main keyword, list related entities, FAQs, and subtopics to cover on a comprehensive authority page.",
      "Suggest 30 blog post ideas for a niche site aimed at beginners in that niche.",
      "Find informational keywords that show strong future purchase intent for a product or service.",
      "Suggest problem-aware keywords people search before buying a specific product type.",
      "Generate seasonal keyword ideas in a niche that spike in a particular month or season.",
      "Create a keyword set to target both English and a second language audience in one country.",
      "Give local-intent keyword ideas for a given service across a city or metro area.",
      "Content briefs and outlines",
      "Create a detailed SEO content brief for one target keyword and a specified audience.",
      "Outline an in-depth pillar article on a topic with H2/H3 structure, FAQs, and internal link ideas.",
      "Turn a keyword list into a 12-month editorial calendar with four posts per month.",
      "Create a content brief that compares two products targeting commercial searchers.",
      "Suggest subheadings and talking points for a best X in year roundup article.",
      "Build a content brief for a BOFU buying guide for a specific product type.",
      "Design a series of five blog posts that warm cold traffic into leads for a defined service.",
      "Create briefs for three how-to tutorials that solve common problems in a niche.",
      "Turn a YouTube topic list into SEO-optimized blog post briefs for the same channel.",
      "For a keyword, suggest a unique angle that differentiates content from the current SERP.",
      "On-page optimization",
      "Rewrite a title and meta description for higher CTR while keeping the main keyword.",
      "Suggest five SEO-friendly title variants for a blog post on a specific topic.",
      "Optimize an article for one primary and two secondary keywords while maintaining natural tone.",
      "Suggest internal link opportunities from existing articles to a new page on a related topic.",
      "Create an SEO-optimized H1, H2s, and H3s for a service page targeting one city.",
      "Recommend keyword placements (H1, intro, subheads, alt text) for a page targeting a defined keyword.",
      "Improve a blog introduction so it better matches the search intent behind its main keyword.",
      "Rewrite a product description to be more SEO-friendly without sounding spammy.",
      "Generate descriptive alt text for images on a page about a specific topic.",
      "Suggest schema types and important properties to add to a page to enhance SERP appearance.",
      "Content improvement and expansion",
      "Analyze an article and suggest sections to expand to improve topical depth and coverage.",
      "Recommend semantic subtopics to add so a post can rank for more long-tail variants of a keyword.",
      "Turn a short FAQ block into a richer, SEO-optimized FAQ section suitable for schema markup.",
      "Show how to convert a thin 500-word post into a comprehensive guide without unnecessary fluff.",
      "Identify outdated parts of an article and suggest updates relevant to 2025.",
      "Propose ways to repurpose a strong blog into a cluster of related posts and a lead magnet.",
      "Improve readability and SEO of a paragraph while preserving its original meaning.",
      "Suggest internal link placements and anchor texts within an article to strengthen a topic cluster.",
      "Spot content cannibalization risk between similar URLs and recommend consolidation or redirects.",
      "Suggest ways to make a blog more aligned with EEAT principles for its niche.",
      "Programmatic and AI-scaled content",
      "Design a template for programmatic SEO pages targeting a pattern like service in city.",
      "Suggest variables and layout for scalable comparison pages for a product category.",
      "Create a safe content template for AI-generated city landing pages for a service across one country.",
      "Outline guardrails to avoid duplicate or thin content when generating many similar pages.",
      "Propose schema and layout templates for programmatic FAQs across multiple product categories.",
      "Generate prompt templates to produce consistent product descriptions at scale for an online store.",
      "Define a workflow to validate and edit AI-generated SEO content before publication.",
      "Suggest quality checks to run on a batch of AI articles before allowing indexing.",
      "Design an experiment to test whether programmatic pages improve organic traffic on the domain.",
      "Create an SOP for VAs using AI to produce SEO content to a fixed standard.",
      "Local SEO and GBP",
      "Audit a Google Business Profile for completeness, relevance, and keyword optimization.",
      "Create 10 post ideas for Google Business Profile tailored to a specific local service.",
      "Suggest which location pages to create for a business serving multiple nearby cities.",
      "Write locally optimized service descriptions for a professional working in one city.",
      "Recommend local link and citation opportunities for a niche business in a defined area.",
      "Create a process to collect, showcase, and reuse customer reviews to boost local SEO.",
      "Propose FAQ content for a local landing page about a given service in a given city.",
      "Suggest geo-modified keywords a service business should target within a region.",
      "Rewrite a local landing page to sound natural while including key local terms.",
      "Propose a content plan that supports both local and national SEO for a hybrid business model.",
      "Link building and digital PR",
      "Analyze a niche and suggest 20 realistic link building opportunities and tactics.",
      "Draft outreach email angles to pitch a guest post about a topic to relevant blogs.",
      "Suggest link-worthy content ideas such as tools, reports, or data studies for a niche site.",
      "Create 10 digital PR angles that a company could use to pitch journalists in its industry.",
      "Improve a cold outreach email so it sounds more personal and less templated.",
      "Identify internal resources that can be turned into linkable assets and promoted.",
      "Propose an ethical, white-hat link building plan for a new site in a tough niche.",
      "Suggest natural anchor text variations for links pointing to a page on a defined topic.",
      "Review a backlink profile snapshot and list the most important issues and opportunities.",
      "Create polite but persistent follow-up email templates for link outreach campaigns.",
      "Technical SEO, UX, and analytics",
      "List the top technical SEO checks to run on a new site using common tools.",
      "Explain ways to improve Core Web Vitals for a blog-heavy site without big development changes.",
      "Recommend page-speed optimizations for an image-heavy ecommerce store.",
      "Suggest a logical internal linking structure for a 100-article blog on a specific topic.",
      "Propose a safe redirect plan for migrating a site from one domain to another.",
      "Explain how to use canonical tags on similar product or filter pages in an online store.",
      "Suggest a URL structure for blog posts and categories in a niche content site.",
      "Create an action list to fix index bloat caused by tag, search, or filter pages.",
      "Recommend how to handle faceted navigation so that important combinations are indexable.",
      "Suggest ways to make the mobile version of a site more search-friendly and user-friendly.",
      "Reporting, experiments, and routines",
      "Suggest which GA4 events and conversions to track for a content-driven site.",
      "Create a simple monthly SEO report structure for clients with meaningful non-vanity metrics.",
      "Propose SEO experiments to run next quarter with clear hypotheses and success metrics.",
      "Turn a traffic and ranking data snapshot into insights and specific SEO next steps.",
      "Suggest how to connect leads and sales to organic SEO performance for a business.",
      "Design a UTM naming convention so SEO-assisted conversions can be analyzed clearly.",
      "Create a framework for prioritizing SEO tasks based on impact and effort for a small team.",
      "Suggest how to combine SEO data with CRM data for better ROI reporting.",
      "Recommend dashboards to build for executives that show SEO impact without too much detail.",
      "Create a weekly SEO routine for a solo operator managing a single niche site."
    ]
  }
}